# Import Libraries

In [1]:
import pandas as pd
import numpy as np
import os

import seaborn as sns
import matplotlib.pyplot as plt
import scipy
%matplotlib inline

# Import data set

In [2]:
path = r'C:\Users\Logan\OneDrive\Desktop\Instacart Basket Analysis'
path

'C:\\Users\\Logan\\OneDrive\\Desktop\\Instacart Basket Analysis'

In [3]:
cust = pd.read_csv(os.path.join(path, '02 Data', 'Original Data', 'customers.csv'))

In [4]:
cust.head()

,user_id,First Name,Surnam,Gender,STATE,Age,date_joined,n_dependants,fam_status,income
0,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665
1,33890,Patricia,Hart,Female,New Mexico,36,1/1/2017,0,single,59285
2,65803,Kenneth,Farley,Male,Idaho,35,1/1/2017,2,married,99568
3,125935,Michelle,Hicks,Female,Iowa,40,1/1/2017,0,single,42049
4,130797,Ann,Gilmore,Female,Maryland,26,1/1/2017,1,married,40374

Wrangle the data so that it follows consistent logic; for example, rename columns with illogical names and drop columns that don’t add anything to your analysis.

In [5]:
# rename columns
cust.columns = ['userid', 'firstname', 'lastname', 'gender', 'state', 'age', 'datejoined', 'numofchildren', 'maritalstatus', 'income']

In [6]:
cust.head(1)

,userid,firstname,lastname,gender,state,age,datejoined,numofchildren,maritalstatus,income
0,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665

In [7]:
# add full name column
cust['fullname'] = cust['firstname'] + ' ' + cust['lastname']

In [8]:
cust.head(1)

,userid,firstname,lastname,gender,state,age,datejoined,numofchildren,maritalstatus,income,fullname
0,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665,Deborah Esquivel

In [9]:
# check values
cust.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 206209 entries, 0 to 206208
Data columns (total 11 columns):
 #   Column         Non-Null Count   Dtype
---  ------         --------------   -----
 0   userid         206209 non-null  int64
 1   firstname      194950 non-null  object
 2   lastname       206209 non-null  object
 3   gender         206209 non-null  object
 4   state          206209 non-null  object
 5   age            206209 non-null  int64
 6   datejoined     206209 non-null  object
 7   numofchildren  206209 non-null  int64
 8   maritalstatus  206209 non-null  object
 9   income         206209 non-null  int64
 10  fullname       194950 non-null  object
dtypes: int64(4), object(7)
memory usage: 17.3+ MB

In [10]:
# convert types
cust['gender'] = cust['gender'].astype('category')
cust['maritalstatus'] = cust['maritalstatus'].astype('category')

In [11]:
cust.describe()

              userid            age  numofchildren         income
count  206209.000000  206209.000000  206209.000000  206209.000000
mean   103105.000000      49.501646       1.499823   94632.852548
std     59527.555167      18.480962       1.118433   42473.786988
min         1.000000      18.000000       0.000000   25903.000000
25%     51553.000000      33.000000       0.000000   59874.000000
50%    103105.000000      49.000000       1.000000   93547.000000
75%    154657.000000      66.000000       3.000000  124244.000000
max    206209.000000      81.000000       3.000000  593901.000000

In [12]:
# missing values
cust.isnull().sum()

userid               0
firstname        11259
lastname             0
gender               0
state                0
age                  0
datejoined           0
numofchildren        0
maritalstatus        0
income               0
fullname         11259
dtype: int64

In [13]:
# filter for null
filt = cust['firstname'].isnull()

In [14]:
# customers with no first name
cust[filt]

,userid,firstname,lastname,gender,state,age,datejoined,numofchildren,maritalstatus,income,fullname
53,76659,NaN,Gilbert,Male,Colorado,26,1/1/2017,2,married,41709,NaN
73,13738,NaN,Frost,Female,Louisiana,39,1/1/2017,0,single,82518,NaN
82,89996,NaN,Dawson,Female,Oregon,52,1/1/2017,3,married,117099,NaN
99,96166,NaN,Oconnor,Male,Oklahoma,51,1/1/2017,1,married,155673,NaN
105,29778,NaN,Dawson,Female,Utah,63,1/1/2017,3,married,151819,NaN
...,...,...,...,...,...,...,...,...,...,...,...
206038,121317,NaN,Melton,Male,Pennsylvania,28,3/31/2020,3,married,87783,NaN
206044,200799,NaN,Copeland,Female,Hawaii,52,4/1/2020,2,married,108488,NaN
206090,167394,NaN,Frost,Female,Hawaii,61,4/1/2020,1,married,45275,NaN
206162,187532,NaN,Floyd,Female,California,39,4/1/2020,0,single,56325,NaN
206171,116898,NaN,Delgado,Female,Colorado,23,4/1/2020,2,married,59222,NaN

In [15]:
# check for duplicates
cust.duplicated().sum()

0

In [16]:
# Check for unique variables

In [17]:
cust['gender'].unique()

['Female', 'Male']
Categories (2, object): ['Female', 'Male']

In [18]:
cust['state'].nunique()

51

In [19]:
cust['state'].unique()

array(['Missouri', 'New Mexico', 'Idaho', 'Iowa', 'Maryland', 'Kentucky',
       'Montana', 'South Carolina', 'Texas', 'Virginia', 'Nevada',
       'Nebraska', 'Georgia', 'Wyoming', 'Colorado', 'North Dakota',
       'Wisconsin', 'Alaska', 'Vermont', 'Arkansas', 'Maine',
       'North Carolina', 'West Virginia', 'Indiana', 'Oregon', 'Florida',
       'California', 'Pennsylvania', 'Ohio', 'Connecticut', 'Arizona',
       'Louisiana', 'Washington', 'New York', 'Mississippi', 'Oklahoma',
       'Utah', 'New Hampshire', 'Hawaii', 'District of Columbia',
       'Alabama', 'Massachusetts', 'Rhode Island', 'Michigan',
       'New Jersey', 'Kansas', 'South Dakota', 'Minnesota', 'Illinois',
       'Tennessee', 'Delaware'], dtype=object)

In [20]:
cust['maritalstatus'].unique()

['married', 'single', 'living with parents and siblings', 'divorced/widowed']
Categories (4, object): ['divorced/widowed', 'living with parents and siblings', 'married', 'single']

In [21]:
#rename userid to user_id
cust.rename(columns = {'userid' : 'user_id'}, inplace = True)

In [22]:
cust.head(1)

,user_id,firstname,lastname,gender,state,age,datejoined,numofchildren,maritalstatus,income,fullname
0,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665,Deborah Esquivel

---

Combine your customer data with the rest of your prepared Instacart data

In [23]:
cust.shape

(206209, 11)

In [24]:
#Import sample dataset
ords_prods_sample = pd.read_pickle(os.path.join(path, '02 Data', 'Prepared Data', '4.9_ords_prods_merge_sample'))

In [25]:
ords_prods_sample.shape

(9721098, 23)

In [26]:
#merge
df_merged = ords_prods_sample.merge(cust, on='user_id', indicator=True)

In [27]:
df_merged.shape

(9721098, 34)

In [28]:
df_merged.head()

,order_id,user_id,order_number,order_day_of_week,order_hour_of_day,days_since_prior_order,product_id,add_to_cart_order,reordered,product_name,...,lastname,gender,state,age,datejoined,numofchildren,maritalstatus,income,fullname,_merge
0,2539329,1,1,2,8,NaN,196,1,0,Soda,...,Nguyen,Female,Alabama,31,2/17/2019,3,married,40423,Linda Nguyen,both
1,473747,1,3,3,12,21.0,196,1,1,Soda,...,Nguyen,Female,Alabama,31,2/17/2019,3,married,40423,Linda Nguyen,both
2,2254736,1,4,4,7,29.0,196,1,1,Soda,...,Nguyen,Female,Alabama,31,2/17/2019,3,married,40423,Linda Nguyen,both
3,550135,1,7,1,9,20.0,196,1,1,Soda,...,Nguyen,Female,Alabama,31,2/17/2019,3,married,40423,Linda Nguyen,both
4,2539329,1,1,2,8,NaN,12427,3,0,Original Beef Jerky,...,Nguyen,Female,Alabama,31,2/17/2019,3,married,40423,Linda Nguyen,both

In [32]:
# check merge
df_merged['_merge'].value_counts()

both          9721098
left_only           0
right_only          0
Name: _merge, dtype: int64

In [ ]:
df_merged.drop(columns = '_merge', inplace = True)

In [35]:
# Export merged sample data set
df_merged.to_pickle(os.path.join(path, '02 Data', 'Prepared Data', '4.9 IC merged_sample.pkl'))